source/_posts/2014-06-21-salt使用笔记.html
---
title: "saltstack使用笔记"
date: 2014-06-21
layout: post
categories: saltstack
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">saltstack使用笔记</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">来由：</h3>
<div class="outline-text-3" id="text-1-1">
<p>
公司需要部署把服务部署到自己的服务器中，每次迁移服务都得重新安装软件<br  />
配置什么东西，身为程序员的我本身比较懒，就想找个工具把配置写好，下次<br  />
部署的时候直接使用配置来玩，而不是每次都手工，所以就发现了 <b>saltstack</b><br  />
这个自动化部署工具了。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">简介</h3>
<div class="outline-text-3" id="text-1-2">
<p>
salt采用的C/S架构，主机master和客户端minion，master通过命令控制客户端minion <br  />
进行相应的任务（软件安装，配置，重启，定时任务，状态监控。。。）。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">核心</h3>
<div class="outline-text-3" id="text-1-3">
<p>
远程执行引擎是Salt的核心，它能够为多组系统创建高速、安全的双向通讯网络。<br  />
基于这个通许系统，Salt提供了一个非常快速、灵活并且容易使用的配置管理系统，<br  />
称之为“Salt States”。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">安装配置</h3>
<div class="outline-text-3" id="text-1-4">
<p>
参考 <a href="http://docs.saltstack.cn/topics/tutorials/walkthrough.html">http://docs.saltstack.cn/topics/tutorials/walkthrough.html</a> <br  />
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#36816;&#34892;</span>
:salt-key -L
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#22914;&#26524;&#20986;&#29616;&#23458;&#25143;&#31471;&#26426;&#22120;&#65292;&#35828;&#26126;&#37197;&#32622;&#25104;&#21151;&#20102;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">使用</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">salt state</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
SLS（代表SaLt State文件）只是结构化的数据。<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#36816;&#34892;</span>
salt <span style="color: #00ff00;">'*'</span> state.highstate
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#20250;&#35753;&#25152;&#26377;&#30340;minion&#21040;master&#19978;&#26469;&#21462;&#36208;&#33258;&#24049;&#30340;SLS&#23450;&#20041;</span>

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#27169;&#25311;&#36816;&#34892;</span>
salt <span style="color: #00ff00;">'minion1.example.com'</span> state.highstate -v <span style="color: #ffff00;">test</span>=True
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">更多使用教程</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
官方文档 <a href="http://docs.saltstack.com/">http://docs.saltstack.com/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">salt 配置文件结构</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">开启salt配置文件</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#20462;&#25913;/etc/salt/master&#25991;&#20214;&#65292;&#21435;&#25481;&#22914;&#19979;&#27880;&#37322;</span>
file_roots:
  base:
    - /srv/salt
  prod:
    - /srv/salt/prod
  dev:
    - /srv/salt/dev


<span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#22914;&#26524;&#38656;&#35201;&#20351;&#29992;pillar&#65292;&#21435;&#25481;&#22914;&#19979;&#27880;&#37322;</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">pillar&#21487;&#20197;&#20801;&#35768;&#20320;&#23450;&#20041;&#19968;&#20123;&#21464;&#37327;&#65292;&#25935;&#24863;&#25968;&#25454;&#65292;&#20855;&#20307;&#21442;&#32771; http://www.ituring.com.cn/article/42398</span>
pillar_root:
  base:
    - /srv/pillar
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">配置文件格式</h4>
<div class="outline-text-4" id="text-1-6-2">
<ol class="org-ol">
<li>salt 的配置文件使用yaml格式，文件名后缀是.sls
</li>
<li>关于yaml格式可以参考<a href="http://www.yaml.org/spec/1.2/spec.html">http://www.yaml.org/spec/1.2/spec.html</a>
<ul class="org-ul">
<li>json是yaml的子集，yaml可以描述更多的东西
</li>
<li>yaml的可读性要比json好，但是身为程序员的我觉得json的可读性更好。
</li>
<li>学习yaml可以使用如下网站进行json和yaml的转换，<a href="http://yamltojson.com/">http://yamltojson.com/</a> ，这样可以更好的理解yaml。
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3">配置文件的目录结构</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">

<pre class="src src-yaml">tops.sls &#65288;&#25551;&#36848;&#25152;&#26377;&#23458;&#25143;&#31471;&#38656;&#35201;&#25191;&#34892;&#30340;&#29366;&#24577;&#65289;
prod &#65288;&#29983;&#20135;&#29615;&#22659;&#37197;&#32622;&#65289;
  -- core &#65288;&#22522;&#26412;&#36719;&#20214;&#23433;&#35013;&#65289;
     -- core.sls
  -- nginx
     -- nginx.sls
     -- nginx.conf
  -- vim
     -- vim.sls
     -- vim.local
  -- git
     -- git.sls
  -- web
     -- web.sls
  -- ...
     -- ...
dev &#65288;&#27979;&#35797;&#29615;&#22659;&#37197;&#32622;&#65289;
  -- ...
     -- ...
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-4" class="outline-4">
<h4 id="sec-1-6-4">配置文件解释</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
core.sls
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">/srv/salt/tops.sls</span>
<span style="color: #ffff00;">prod</span>:
  <span style="color: #ffff00;">'*'</span>:   <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#25152;&#26377;minion&#37117;&#35201;&#33719;&#21462;core&#29366;&#24577;</span>
    - core.core

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">/srv/salt/prod/core/core.sls</span>
<span style="color: #ffff00;">mypkgs</span>:
  <span style="color: #ffff00;">pkg.installed</span>:
    - <span style="color: #ffff00;">pkgs</span>:
      - gcc
      - python-dev
      - tmux
      - build-essential
      - g++
      - ...
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">总结</h3>
<div class="outline-text-3" id="text-1-7">
<p>
saltstack 可以让你像编程一样去管理服务器，简单，高效，有趣。
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">参考</h3>
<div class="outline-text-3" id="text-1-8">
<blockquote>
<p>
<a href="http://docs.saltstack.cn/topics/tutorials/walkthrough.html">saltstack演练</a> <br  />
<a href="http://docs.saltstack.cn/topics/tutorials/starting_states.html">http://docs.saltstack.cn/topics/tutorials/starting_states.html</a> <br  />
<a href="http://www.ituring.com.cn/article/42398">http://www.ituring.com.cn/article/42398</a> <br  />
</p>
</blockquote>
<p>
<!-- more -->
</p>
</div>
</div>
</div>
